{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.3", "userDefinedMetadata": {"signature": {"inputs": {"input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "64"}]}}, "input_4:0": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "input_5:0": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "64"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "input_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "64"}]}}}}, {"name": "input_4", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "input_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^input_3", "^input_4", "^input_5"]}, {"name": "StatefulPartitionedCall/model_1/up_sampling2d/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/stack/3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_42/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_42/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_43/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_43/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_44/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_44/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_45/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_45/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_46/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_46/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_47/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_47/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_48/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_48/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_49/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_49/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_50/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_50/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_51/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_51/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_52/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_52/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_53/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_53/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_54/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_54/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_55/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_55/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_56/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_56/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_57/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_57/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_58/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_58/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_59/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_59/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_60/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_60/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_61/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_61/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_62/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_62/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_63/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_63/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_64/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_64/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "2"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_65/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_65/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_42/BiasAdd", "op": "_FusedConv2D", "input": ["input_3", "StatefulPartitionedCall/model_1/conv2d_42/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_42/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_44/BiasAdd", "op": "_FusedConv2D", "input": ["input_3", "StatefulPartitionedCall/model_1/conv2d_44/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_44/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_56", "op": "NoOp", "input": ["^StatefulPartitionedCall/model_1/conv2d_42/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_42/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_43/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_43/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_44/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_44/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_45/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_45/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_46/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_46/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_47/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_47/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_48/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_48/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_49/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_49/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_50/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_50/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_51/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_51/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_52/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_52/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_53/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_53/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_54/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_54/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_55/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_55/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_56/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_56/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_57/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_57/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_58/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_58/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_59/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_59/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_60/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_60/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_61/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_61/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_62/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_62/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_63/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_63/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_64/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_64/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_65/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_65/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_transpose/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model_1/conv2d_transpose/conv2d_transpose/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_46/Sigmoid_46", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_42/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_46/Mul_46", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_42/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_46/Sigmoid_46"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_43/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_46/Mul_46", "StatefulPartitionedCall/model_1/conv2d_43/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_43/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_47/Sigmoid_47", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_43/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_47/Mul_47", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_43/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_47/Sigmoid_47"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_15/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_44/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Mul_47/Mul_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_48/Sigmoid_48", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/add_15/add"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_48/Mul_48", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/add_15/add", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_48/Sigmoid_48"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_45/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_48/Mul_48", "StatefulPartitionedCall/model_1/conv2d_45/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_45/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_47/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_48/Mul_48", "StatefulPartitionedCall/model_1/conv2d_47/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_47/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_49/Sigmoid_49", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_45/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_49/Mul_49", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_45/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_49/Sigmoid_49"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_46/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_49/Mul_49", "StatefulPartitionedCall/model_1/conv2d_46/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_46/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_50/Sigmoid_50", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_46/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_50/Mul_50", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_46/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_50/Sigmoid_50"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_16/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_47/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Mul_50/Mul_50"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_51/Sigmoid_51", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/add_16/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_51/Mul_51", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/add_16/add", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_51/Sigmoid_51"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_48/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_51/Mul_51", "StatefulPartitionedCall/model_1/conv2d_48/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_48/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_50/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_51/Mul_51", "StatefulPartitionedCall/model_1/conv2d_50/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_50/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_52/Sigmoid_52", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_48/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_52/Mul_52", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_48/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_52/Sigmoid_52"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_49/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_52/Mul_52", "StatefulPartitionedCall/model_1/conv2d_49/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_49/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_53/Sigmoid_53", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_49/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_53/Mul_53", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_49/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_53/Sigmoid_53"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_17/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_50/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Mul_53/Mul_53"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_54/Sigmoid_54", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/add_17/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_54/Mul_54", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/add_17/add", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_54/Sigmoid_54"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_51/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_54/Mul_54", "StatefulPartitionedCall/model_1/conv2d_51/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_51/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_53/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_54/Mul_54", "StatefulPartitionedCall/model_1/conv2d_53/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_53/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_55/Sigmoid_55", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_51/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_55/Mul_55", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_51/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_55/Sigmoid_55"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_52/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_55/Mul_55", "StatefulPartitionedCall/model_1/conv2d_52/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_52/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_56/Sigmoid_56", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_52/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_56/Mul_56", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_52/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_56/Sigmoid_56"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/add_18/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_53/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Mul_56/Mul_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_57/Sigmoid_57", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/add_18/add"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_57/Mul_57", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/add_18/add", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_57/Sigmoid_57"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/multiply_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_57/Mul_57", "input_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_19/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/multiply_1/mul", "input_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1/add_19/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/add_19/add", "^Func/StatefulPartitionedCall/output_control_node/_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/add/y", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/add/y", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice", "StatefulPartitionedCall/model_1/conv2d_transpose/add", "StatefulPartitionedCall/model_1/conv2d_transpose/add_1", "StatefulPartitionedCall/model_1/conv2d_transpose/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/stack", "StatefulPartitionedCall/model_1/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_1/add_19/add"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/model_1/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/up_sampling2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/up_sampling2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/up_sampling2d/Shape", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/conv2d_transpose/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/up_sampling2d/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/up_sampling2d/Const", "StatefulPartitionedCall/model_1/up_sampling2d/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_1/conv2d_transpose/BiasAdd", "StatefulPartitionedCall/model_1/up_sampling2d/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_56/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model_1/conv2d_56/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_56/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_54/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model_1/conv2d_54/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_54/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_58/Sigmoid_58", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_54/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_58/Mul_58", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_54/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_58/Sigmoid_58"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_55/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_58/Mul_58", "StatefulPartitionedCall/model_1/conv2d_55/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_55/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_59/Sigmoid_59", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_55/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_59/Mul_59", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_55/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_59/Sigmoid_59"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/add_20/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/conv2d_56/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Mul_59/Mul_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_60/Sigmoid_60", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/add_20/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_60/Mul_60", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/add_20/add", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_60/Sigmoid_60"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_59/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_60/Mul_60", "StatefulPartitionedCall/model_1/conv2d_59/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_59/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_57/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_60/Mul_60", "StatefulPartitionedCall/model_1/conv2d_57/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_57/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_61/Sigmoid_61", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_57/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_61/Mul_61", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/conv2d_57/BiasAdd", "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_61/Sigmoid_61"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_58/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Mul_61/Mul_61", "StatefulPartitionedCall/model_1/conv2d_58/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/conv2d_58/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sigmoid_62/Sigmoid_62", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_1/conv2d_58/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Mul_62/Mul_62", "op": "Mul", "input": 